static drift/KVLCC2/Fr0.1424_alpha0.00/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      p_rgh;
}

#include      "include/initialConditions";

dimensions    [1 -1 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
	#includeEtc	"caseDicts/setConstraintTypes"

	inlet
	{
		type	fixedFluxPressure;
		value	$internalField;
	}


	outlet
	{
		type	fixedValue;
		value	$internalField;
	}


	midPlane
	{
		type	symmetryPlane;
	}


	top
	{
		type	totalPressure;
		value	$internalField;
		p0	uniform 0;
	}


	hull
	{
		type	fixedFluxPressure;
	}


	deck
	{
		type	fixedFluxPressure;
	}

}
